#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/softbaked/cd-demo/runs/run-UPj22ownqZQjNwfd[0m
[0m
Waiting for the plan to start...

Terraform v0.13.3
Configuring remote state backend...
Initializing Terraform configuration...
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mrandom_pet.sg: Refreshing state... [id=eager-primate][0m
[0m[1maws_security_group.web-sg: Refreshing state... [id=sg-02787dda5c9571b79][0m
[0m[1maws_instance.web: Refreshing state... [id=i-03d6c7c0bf2a11cec][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_db_parameter_group.default[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "default" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mfamily[0m[0m      = "aurora"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "rds-pg"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
    }

[1m  # aws_rds_cluster.database-2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster" "database-2" {
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbackup_retention_period[0m[0m         = 1
      [32m+[0m [0m[1m[0mcluster_identifier[0m[0m              = "database-2"
      [32m+[0m [0m[1m[0mcluster_identifier_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mcluster_members[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mcluster_resource_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m           = false
      [32m+[0m [0m[1m[0mdatabase_name[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mdb_cluster_parameter_group_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0menable_http_endpoint[0m[0m            = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                          = "aurora"
      [32m+[0m [0m[1m[0mengine_mode[0m[0m                     = "provisioned"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmaster_username[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_backup_window[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_maintenance_window[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mreader_endpoint[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mskip_final_snapshot[0m[0m             = false
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m          = (known after apply)
    }

[1m  # aws_rds_cluster_instance.writer[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster_instance" "writer" {
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mauto_minor_version_upgrade[0m[0m      = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mca_cert_identifier[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcluster_identifier[0m[0m              = "database-2"
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m           = false
      [32m+[0m [0m[1m[0mdb_parameter_group_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mdbi_resource_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                          = "aurora"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                  = "5.6.mysql_aurora.1.22.2"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0midentifier[0m[0m                      = "database-2-instance-1"
      [32m+[0m [0m[1m[0midentifier_prefix[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0minstance_class[0m[0m                  = "t3.small"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_interval[0m[0m             = 0
      [32m+[0m [0m[1m[0mmonitoring_role_arn[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_enabled[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_kms_key_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_backup_window[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_maintenance_window[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mpromotion_tier[0m[0m                  = 0
      [32m+[0m [0m[1m[0mpublicly_accessible[0m[0m             = false
      [32m+[0m [0m[1m[0mstorage_encrypted[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwriter[0m[0m                          = (known after apply)
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.[0m
```

</details>

*Pusher: @gold3nfish, Action: `pull_request`*